MORSE = {
    ".-": "a",
    "-...": "b",
    "-.-.": "c",
    "-..": "d",
    ".": "e",
    "..-.": "f",
    "--.": "g",
    "....": "h",
    "..": "i",
    ".---": "j",
    "-.-": "k",
    ".-..": "l",
    "--": "m",
    "-.": "n",
    "---": "o",
    ".--.": "p",
    "--.-": "q",
    ".-.": "r",
    "...": "s",
    "-": "t",
    "..-": "u",
    "...-": "v",
    ".--": "w",
    "-..-": "x",
    "-.--": "y",
    "--..": "z",
    "-----": "0",
    ".----": "1",
    "..---": "2",
    "...--": "3",
    "....-": "4",
    ".....": "5",
    "-....": "6",
    "--...": "7",
    "---..": "8",
    "----.": "9",
}


def morse_decoder(code: str):
    """
        Ваша задача - расшифровать сообщение используя азбуку Морзе.
        В шифровке будет использован 1 пробел между буквами одного слова и 3 пробела между отдельными словами.
        Если расшифрованный текст начинается со слова, первая буква этого слова должна быть заглавной.
    """
    l = list()
    ll = list()

    for _ in code.split('   '):
        l.append(_.split(' '))

    for _ in l:
        ll.append(''.join([MORSE.get(i, i) for i in _]))

    res = ' '.join(ll)
    if res[0].isalpha():
        return res.capitalize()

    return res


if __name__ == '__main__':
    assert morse_decoder("... --- -- .   - . -..- -") == "Some text"
    assert (
            morse_decoder("..   .-- .- ...   -... --- .-. -.   .. -.   .---- ----. ----. -----")
            == "I was born in 1990"
    )
